package oop;

public class Ex01 {
	/*
		OOP : Object Oriented Programming
		- 객체 지향 프로그래밍
		- 객체를 정의하고 객체 간의 상호작용을 구성해서 프로그램을 작성하는 기법
		- 높은 재사용성, 유지보수 효율
		
		Object		: 객체, 현실의 모든 데이터
		Class		: 클래스, 객체를 코드로 표현한 상태 (= 도면)
		Instance	: 인스턴스, 클래스를 컴퓨터 메모리에 생성한 상태 (= 실체)
		
		
		1. 객체를 선정 -> 2. 클래스로 표현 -> 3. 메모리에 생성 -> 4. 상호작용 구성
	 	
	 	
	 	class 클래스명 {
	 		1. 필드	: 멤버 변수. 객체의 속성을 정의
	 		ex) 사람의 이름, 나이, 주소 등
	 		
	 		2. 메서드	: 멤버 함수. 객체의 기능을 정의
	 		ex) 사람이 잔다. 사람이 먹는다
	 	}
	 	
	 	new 클래스명() : 해당 클래스를 메모리에 생성. 즉, 인스턴스를 생성
	 	- 여러번 재사용을 위해서 참조 변수로 가리켜 놔야 한다
	 */
}
