package loop2;

public class Quiz {
	/*
		별 찍기
		1번) N x N 찍기
		입력 : 5
	 	*****
	 	*****
	 	*****
	 	*****
	 	*****
	 	
	 	2번) 직각삼각형
		입력 : 5
	 	*
	 	**
	 	***
	 	****
	 	*****
	 	
	 	3번) 위아래 반전
		입력 : 5
	 	*****
	 	****
	 	***
	 	**
	 	*
	 	
	 	4번) 2번을 좌우반전
	 	    *
		   **
		  ***
		 ****
		*****
		
		5번) 4번을 위아래 반전		
		*****
		 ****
		  ***
		   **
		    *
		
		6번) 피라미드
		입력 : 5
		
		    *
		   ***
		  *****
		 *******
		*********
		
		7번) 6번 반전
		*********
		 *******
		  *****
		   ***
		    *
	 */
}
